In [32]:
#importing the necessary library's
import pandas as pd #data manipulation
import psycopg2 #for connectivity
from sqlalchemy import create_engine

In [4]:
#Extracting the data from the data source
df = pd.read_csv('Softwork Technologies - Sheet1.csv')

In [26]:
#exploratory data analysis
df.head()

,employee_id,department,region,education,gender,recruitment_channel,no_of_trainings,age,previous_year_rating,length_of_service,awards_won,avg_training_score
0,8724,Technology,region_26,Bachelor's,m,sourcing,1,24,NaN,1,0,77
1,74430,HR,region_4,Bachelor's,f,other,1,31,3.0,5,0,51
2,72255,Sales & Marketing,region_13,Bachelor's,m,other,1,31,1.0,4,0,47
3,38562,Procurement,region_2,Bachelor's,f,other,3,31,2.0,9,0,65
4,64486,Finance,region_29,Bachelor's,m,sourcing,1,30,4.0,7,0,61

In [5]:
df.describe()

,employee_id,no_of_trainings,age,previous_year_rating,length_of_service,awards_won,avg_training_score
count,23490.000000,23490.000000,23490.000000,21678.000000,23490.000000,23490.000000,23490.000000
mean,39041.399149,1.254236,34.782929,3.339146,5.810387,0.022776,63.263133
std,22640.809201,0.600910,7.679492,1.263294,4.207917,0.149191,13.411750
min,3.000000,1.000000,20.000000,1.000000,1.000000,0.000000,39.000000
25%,19370.250000,1.000000,29.000000,3.000000,3.000000,0.000000,51.000000
50%,38963.500000,1.000000,33.000000,3.000000,5.000000,0.000000,60.000000
75%,58690.000000,1.000000,39.000000,4.000000,7.000000,0.000000,76.000000
max,78295.000000,9.000000,60.000000,5.000000,34.000000,1.000000,99.000000

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 23490 entries, 0 to 23489
Data columns (total 12 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   employee_id           23490 non-null  int64
 1   department            23490 non-null  object
 2   region                23490 non-null  object
 3   education             22456 non-null  object
 4   gender                23490 non-null  object
 5   recruitment_channel   23490 non-null  object
 6   no_of_trainings       23490 non-null  int64
 7   age                   23490 non-null  int64
 8   previous_year_rating  21678 non-null  float64
 9   length_of_service     23490 non-null  int64
 10  awards_won            23490 non-null  int64
 11  avg_training_score    23490 non-null  int64
dtypes: float64(1), int64(6), object(5)
memory usage: 2.2+ MB

In [7]:
print(f'There are {df.duplicated().sum()} duplicates')#the amount of duplicated data

There are 0 duplicates

In [8]:
df.isnull().sum() #the amount of null values in each column

employee_id                0
department                 0
region                     0
education               1034
gender                     0
recruitment_channel        0
no_of_trainings            0
age                        0
previous_year_rating    1812
length_of_service          0
awards_won                 0
avg_training_score         0
dtype: int64

In [10]:
df[df['education'].isnull()]

,employee_id,department,region,education,gender,recruitment_channel,no_of_trainings,age,previous_year_rating,length_of_service,awards_won,avg_training_score
49,3720,Sales & Marketing,region_2,NaN,m,sourcing,1,36,5.0,4,0,49
67,26977,Operations,region_2,NaN,m,sourcing,1,28,3.0,3,0,59
89,2347,Analytics,region_15,NaN,m,other,2,37,5.0,8,0,82
127,42719,Analytics,region_21,NaN,m,sourcing,1,27,NaN,1,0,80
138,2721,Analytics,region_22,NaN,f,sourcing,2,26,5.0,3,0,86
...,...,...,...,...,...,...,...,...,...,...,...,...
23415,14036,Sales & Marketing,region_7,NaN,m,other,6,26,3.0,3,0,48
23424,5890,Analytics,region_15,NaN,m,sourcing,1,34,3.0,5,0,87
23452,65429,Analytics,region_15,NaN,m,sourcing,1,30,2.0,7,0,83
23459,30477,Sales & Marketing,region_22,NaN,m,other,1,31,2.0,7,0,52
23482,27284,Sales & Marketing,region_2,NaN,m,sourcing,2,44,4.0,4,0,49

In [11]:
df[df['previous_year_rating'].isnull()]

,employee_id,department,region,education,gender,recruitment_channel,no_of_trainings,age,previous_year_rating,length_of_service,awards_won,avg_training_score
0,8724,Technology,region_26,Bachelor's,m,sourcing,1,24,NaN,1,0,77
21,5677,Technology,region_17,Bachelor's,m,sourcing,1,25,NaN,1,0,80
32,67672,Technology,region_17,Bachelor's,m,other,1,29,NaN,1,0,85
39,55325,Analytics,region_22,Bachelor's,m,other,1,25,NaN,1,0,88
47,44159,Analytics,region_22,Master's & above,m,other,1,31,NaN,1,0,84
...,...,...,...,...,...,...,...,...,...,...,...,...
23406,53291,Operations,region_4,Bachelor's,m,sourcing,1,32,NaN,1,0,62
23436,10138,Technology,region_2,Bachelor's,f,referred,1,29,NaN,1,0,79
23445,65765,Analytics,region_31,Bachelor's,m,sourcing,3,28,NaN,1,0,86
23479,39410,Sales & Marketing,region_2,Bachelor's,m,other,3,20,NaN,1,0,49
23488,1186,Procurement,region_31,Bachelor's,m,sourcing,3,27,NaN,1,0,70

In [1]:
#df.dropna(inplace = True) #we dont want to remove the employees just because we dont know their educatioonal status
#df.drop_duplicates(inplace = True)

NameError: name 'df' is not defined

In [16]:
df['education'].fillna('unknown',inplace=True)
#all the null values in the education column has been replaced with unknown
df['previous_year_rating'].fillna(0,inplace=True)
#The previous year ratings that were null are now 0

In [17]:
df.isna().sum()

employee_id             0
department              0
region                  0
education               0
gender                  0
recruitment_channel     0
no_of_trainings         0
age                     0
previous_year_rating    0
length_of_service       0
awards_won              0
avg_training_score      0
dtype: int64

In [22]:
df.isnull().sum()

employee_id             0
department              0
region                  0
education               0
gender                  0
recruitment_channel     0
no_of_trainings         0
age                     0
previous_year_rating    0
length_of_service       0
awards_won              0
avg_training_score      0
dtype: int64

In [39]:
#creating the database/connecting to the database

#db credentials
username = 'postgres'
password = '********'
host = 'localhost'
port = 5432
db_name = 'postgres'

In [40]:
#establishing a connection
engine = create_engine(f'postgresql://{username}:{password}@{host}:{port}/{db_name}')

In [43]:
#load the data into emp_tble , this is the name of the table in the database
df.to_sql('emp_tble', engine, if_exists = 'replace', index= False)

#close the connection
engine.dispose()